logs/fio-diskrnd/Strato 4v 8GB/000/log008.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;521015;2035;32201;0;0;0.000000;0.000000;68;57817;482.407613;2206.016819;1.000000%=71;5.000000%=72;10.000000%=74;20.000000%=76;30.000000%=78;40.000000%=82;50.000000%=86;60.000000%=91;70.000000%=100;80.000000%=116;90.000000%=134;95.000000%=162;99.000000%=13565;99.500000%=13697;99.900000%=14352;99.950000%=14745;99.990000%=17694;0%=0;0%=0;0%=0;69;57819;484.403727;2205.979565;475136;2123264;100.000000%;521456.000000;205997.160675;0.428571%;20.838509%;2088;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;69.00%;27.83%;0.08%;0.01%;0.00%;0.01%;0.00%;0.50%;2.58%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;45328;0;59;0;1501779;1501780;97.67%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3915: Mon Jan  8 14:22:46 2024
  write: IOPS=2035, BW=509MiB/s (534MB/s)(16.0GiB/32201msec); 0 zone resets
    clat (usec): min=68, max=57817, avg=482.41, stdev=2206.02
     lat (usec): min=69, max=57819, avg=484.40, stdev=2205.98
    clat percentiles (usec):
     |  1.00th=[   72],  5.00th=[   73], 10.00th=[   75], 20.00th=[   77],
     | 30.00th=[   79], 40.00th=[   83], 50.00th=[   87], 60.00th=[   92],
     | 70.00th=[  101], 80.00th=[  117], 90.00th=[  135], 95.00th=[  163],
     | 99.00th=[13566], 99.50th=[13698], 99.90th=[14353], 99.95th=[14746],
     | 99.99th=[17695]
   bw (  KiB/s): min=475136, max=2123264, per=100.00%, avg=521456.00, stdev=205997.16, samples=64
   iops        : min= 1856, max= 8294, avg=2036.94, stdev=804.68, samples=64
  lat (usec)   : 100=69.00%, 250=27.83%, 500=0.08%, 750=0.01%
  lat (msec)   : 2=0.01%, 10=0.50%, 20=2.58%, 50=0.01%, 100=0.01%
  cpu          : usr=0.43%, sys=20.84%, ctx=2088, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=509MiB/s (534MB/s), 509MiB/s-509MiB/s (534MB/s-534MB/s), io=16.0GiB (17.2GB), run=32201-32201msec

Disk stats (read/write):
  vda: ios=0/45328, merge=0/59, ticks=0/1501779, in_queue=1501780, util=97.67%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;483089;1887;34729;0;0;0.000000;0.000000;226;3540;522.460938;66.193884;1.000000%=337;5.000000%=436;10.000000%=456;20.000000%=477;30.000000%=497;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=569;90.000000%=585;95.000000%=610;99.000000%=700;99.500000%=757;99.900000%=880;99.950000%=995;99.990000%=1990;0%=0;0%=0;0%=0;226;3540;522.610858;66.190770;172544;529408;100.000000%;483365.101449;39544.220679;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.509675%;17.769523%;65604;0;73;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.12%;31.56%;67.78%;0.49%;0.04%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65790;3084;0;17;28921;64984;93905;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3918: Mon Jan  8 14:23:21 2024
  read: IOPS=1887, BW=472MiB/s (495MB/s)(16.0GiB/34729msec)
    clat (usec): min=226, max=3540, avg=522.46, stdev=66.19
     lat (usec): min=226, max=3540, avg=522.61, stdev=66.19
    clat percentiles (usec):
     |  1.00th=[  338],  5.00th=[  437], 10.00th=[  457], 20.00th=[  478],
     | 30.00th=[  498], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  570], 90.00th=[  586], 95.00th=[  611],
     | 99.00th=[  701], 99.50th=[  758], 99.90th=[  881], 99.95th=[  996],
     | 99.99th=[ 1991]
   bw (  KiB/s): min=172544, max=529408, per=100.00%, avg=483365.10, stdev=39544.22, samples=69
   iops        : min=  674, max= 2068, avg=1888.14, stdev=154.47, samples=69
  lat (usec)   : 250=0.12%, 500=31.56%, 750=67.78%, 1000=0.49%
  lat (msec)   : 2=0.04%, 4=0.01%
  cpu          : usr=0.51%, sys=17.77%, ctx=65604, majf=0, minf=73
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=472MiB/s (495MB/s), 472MiB/s-472MiB/s (495MB/s-495MB/s), io=16.0GiB (17.2GB), run=34729-34729msec

Disk stats (read/write):
  vda: ios=65790/3084, merge=0/17, ticks=28921/64984, in_queue=93905, util=100.00%