logs/fio-diskrnd/Strato 4v 8GB/000/log009.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;520465;2033;32235;0;0;0.000000;0.000000;62;64088;483.829566;2291.772993;1.000000%=71;5.000000%=72;10.000000%=73;20.000000%=75;30.000000%=78;40.000000%=82;50.000000%=87;60.000000%=92;70.000000%=102;80.000000%=116;90.000000%=134;95.000000%=158;99.000000%=13434;99.500000%=13697;99.900000%=15269;99.950000%=17694;99.990000%=45875;0%=0;0%=0;0%=0;63;64091;485.774765;2291.757576;416256;1821184;100.000000%;520904.000000;181363.935838;0.558417%;20.543525%;2119;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;67.46%;29.43%;0.06%;0.01%;0.01%;0.01%;0.01%;0.43%;2.56%;0.02%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;1183;45747;118;677;219;1437888;1438138;97.97%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3946: Mon Jan  8 14:24:03 2024
  write: IOPS=2033, BW=508MiB/s (533MB/s)(16.0GiB/32235msec); 0 zone resets
    clat (usec): min=62, max=64088, avg=483.83, stdev=2291.77
     lat (usec): min=63, max=64091, avg=485.77, stdev=2291.76
    clat percentiles (usec):
     |  1.00th=[   72],  5.00th=[   73], 10.00th=[   74], 20.00th=[   76],
     | 30.00th=[   79], 40.00th=[   83], 50.00th=[   88], 60.00th=[   93],
     | 70.00th=[  103], 80.00th=[  117], 90.00th=[  135], 95.00th=[  159],
     | 99.00th=[13435], 99.50th=[13698], 99.90th=[15270], 99.95th=[17695],
     | 99.99th=[45876]
   bw (  KiB/s): min=416256, max=1821184, per=100.00%, avg=520904.00, stdev=181363.94, samples=64
   iops        : min= 1626, max= 7114, avg=2034.78, stdev=708.45, samples=64
  lat (usec)   : 100=67.46%, 250=29.43%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.43%, 20=2.56%, 50=0.02%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.56%, sys=20.54%, ctx=2119, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=508MiB/s (533MB/s), 508MiB/s-508MiB/s (533MB/s-533MB/s), io=16.0GiB (17.2GB), run=32235-32235msec

Disk stats (read/write):
  vda: ios=1183/45747, merge=118/677, ticks=219/1437888, in_queue=1438138, util=97.97%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;485058;1894;34588;0;0;0.000000;0.000000;217;8320;521.330331;94.622935;1.000000%=288;5.000000%=411;10.000000%=452;20.000000%=473;30.000000%=493;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=569;90.000000%=585;95.000000%=610;99.000000%=716;99.500000%=798;99.900000%=1646;99.950000%=1892;99.990000%=2277;0%=0;0%=0;0%=0;218;8320;521.461166;94.621633;261620;495104;100.000000%;485368.405797;27344.845684;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.453928%;17.327320%;65599;0;73;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.28%;32.50%;66.50%;0.40%;0.29%;0.04%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65223;3024;0;11;28682;64871;93554;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=4100: Mon Jan  8 14:24:38 2024
  read: IOPS=1894, BW=474MiB/s (497MB/s)(16.0GiB/34588msec)
    clat (usec): min=217, max=8320, avg=521.33, stdev=94.62
     lat (usec): min=218, max=8320, avg=521.46, stdev=94.62
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  412], 10.00th=[  453], 20.00th=[  474],
     | 30.00th=[  494], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  570], 90.00th=[  586], 95.00th=[  611],
     | 99.00th=[  717], 99.50th=[  799], 99.90th=[ 1647], 99.95th=[ 1893],
     | 99.99th=[ 2278]
   bw (  KiB/s): min=261620, max=495104, per=100.00%, avg=485368.41, stdev=27344.85, samples=69
   iops        : min= 1021, max= 1934, avg=1895.96, stdev=106.93, samples=69
  lat (usec)   : 250=0.28%, 500=32.50%, 750=66.50%, 1000=0.40%
  lat (msec)   : 2=0.29%, 4=0.04%, 10=0.01%
  cpu          : usr=0.45%, sys=17.33%, ctx=65599, majf=0, minf=73
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=474MiB/s (497MB/s), 474MiB/s-474MiB/s (497MB/s-497MB/s), io=16.0GiB (17.2GB), run=34588-34588msec

Disk stats (read/write):
  vda: ios=65223/3024, merge=0/11, ticks=28682/64871, in_queue=93554, util=100.00%